"""Напишите программу, которая моделирует бросание двух игральных кубиков: при запуске
выводит случайное число в диапазоне от 2 до 12."""
import random
print(random.randint(2,12))