'''Напишите рекурсивную процедуру для перевода числа в шестнадцатеричную систему
счисления.'''


def r_hex(N):
    f = ['0', '1', '2', '3', '4', '5', '6', '7',
         '8', '9', 'A', 'B', 'C', 'D', 'E', 'F']
    if N == 0:
        return ""
    if N > 0:
        return r_hex(N // 16) + f[N % 16]
    if N < 0:
        return "-" + r_hex(abs(N) // 16) + f[abs(N) % 16]


s = int(input("Введите число:"))
if s == 0:
    print(0)
else:
    print(r_hex(s))
