'''Напишите процедуру для ввода длинных чисел
из файла в массив (список).'''


f = open("XOX.txt")
for i in f:
    print([i])