'''Напишите полную программу для извлечения целого квадратного корня из целого числа.
Проверьте, как она будет работать, если на вход функции isqrt подать нецелое значение.'''
from math import isqrt

a = isqrt(12)
print(a)

