"""Напишите программу, которая вводит с клавиатуры натуральное число N и определяет его
факториал, то есть произведение натуральных чисел от 1 до N."""

import math
N = int(input("Введите число: "))

print(math.factorial(N))