""" Напишите программу, которая выводит на экран все цифры числа, начиная с первой."""
b = input()
for a in b:
    print(a)
