'''Напишите процедуру, которая выводит переданное ей число прописью. Например, 21
«двадцать один».'''


def a (n):
    b = {0: "ноль", 1: "один", 2: "два", 3: "три", 4: "четыре", 5: "пять",
         6: "шесть", 7: "семь", 8: "восемь", 9: "девять"}
    c = {10: "десять", 20: "двадцать", 30: "тридцать", 40: "сорок",
         50: "пятьдесят", 60: "шестьдесят", 70: "семьдесят",
         80: "восемьдесят", 90: "девяносто", 100: "сто", 200: "двести", 300: "триста"}
    d = {11: "одиннадцать", 12: "двенадцать", 13: "тринадцать",
         14: "четырнадцать", 15: "пятнадцать", 16: "шестнадцать",
         17: "семнадцать", 18: "восемнадцать", 19: "девятнадцать"}

    n1 = n % 10
    n2 = n - n1
    if n < 0:
        print("Error")
    elif n < 10:
        return b.get(n)
    elif 10 < n < 20:
        return d.get(n)
    elif n >= 10 and n in c:
        return c.get(n)
    else:
        return c.get(n2) + " " + b.get(n1)

print(a(int(input("Введите число: "))))

