"""Напишите процедуру, которая выводит на экран в столбик все цифры переданного ей числа,
начиная с первой."""

def noReverse(N):
    for i in (str(N)):
        print(i)
noReverse(int(input("")))
